import 'dart:io';
void main() {
print('Режим "Попугай" включен. Введите текст (для выхода введите "стоп"):');
while (true) {
String? input = stdin.readLineSync();

if (input == 'стоп') {
print('Программа остановлена');
break;
}
print('Попугай повторяет: $input');
  }
}


while - мы его используем когда нужно повторять одно и тоже действие, когда выполняется какое-то условие.
а while(true) делает цикл бесконечным, действие будет продолжаться до бесконечности, 
потому что не будет ложным из-за true. 
а break используем чтобы остановить программу.
а $ интерполяция